app/controllers/friendships_controller.rb

  def load_friend
    @friend = User.find_by_username(params[:friend])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'ryan') LIMIT 1