app/controllers/group_memberships_controller.rb

SELECT * FROM `users` WHERE (`users`.`username` = 'ryan') LIMIT 1
---
  def load_friend_from_param
    @friend = nil
    unless params[:friend] == nil: @friend = User.find_by_username(params[:friend]) end