app/controllers/log_entries_controller.rb

  def load_log_entry_from_param
    redirect_to user_path(params[:username]) if @user == nil
    @log_entry = nil
    unless @user == nil
      @log_entry = @user.log_entries.find_by_index(params[:index])
---
SELECT * FROM `log_entries` WHERE (`log_entries`.`index` = '1') AND (`log_entries`.user_id = 13) LIMIT 1