app/controllers/sessions_controller.rb

SELECT * FROM `users` WHERE (`users`.`password` = '005d343c2e2bdf0eb71e2880fef54140' AND `users`.`email` = 'ryan.martin@thestreet.com') LIMIT 1
---
  def create
		@page[:title] = t(:title_login)
		params[:password] = Digest::MD5.hexdigest(params[:password])
		@current_user = User.find_by_email_and_password(params[:email], params[:password])