app/controllers/users_controller.rb

  def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO `users` (`created_at`, `password_recovery_code_set`, `updated_at`, `username`, `last_name`, `verified`, `verification_code`, `password`, `email`, `first_name`, `password_recovery_code`) VALUES('2010-11-19 03:56:07', NULL, '2010-11-19 03:56:07', 'rlmartinx', 'Martin', 0, '5dd235ecf41bc62f805a0485ca13b05f', '005d343c2e2bdf0eb71e2880fef54140', 'ryan.martin@thestreet.com', 'Ryan', '')

  def destroy
		# Only allow deleting if the user has permission.
		if @can_delete
			@page[:title] = t(:title_user_delete)
			User.delete(@user.id)
---
DELETE FROM `users` WHERE (`id` IN (6))

	def process_forgot_password
    @user = User.find_by_email(params[:email])
---
SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'rlmartin@gmail.com' AND `users`.id <> 11) LIMIT 1

	def process_resend_verify
    @user = User.find_by_email(params[:email])
    if @user == nil
      flash.now[:error] = t(:msg_email_not_found)
    elsif @user.verified
      flash.now[:error] = t(:msg_already_verified)
    else
      bolResult = false
      if @user.verification_code == ''
        @user.set_verification_code
        bolResult = @user.save
---
SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'rlmartin@gmail.com' AND `users`.id <> 11) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-11-28 15:34:48', `verification_code` = '21a68b28e8952dfff0052a588f3b8eb8', `password` = '6c94c1b455c895a958799f24e171e908' WHERE `id` = 11

	def process_reset_password
    if @user == nil
      flash.now[:error] = t(:msg_user_not_found)
    elsif @user.password_recovery_code != params[:password_recovery_code]
      flash.now[:error] = t(:msg_invalid_password_recovery_code)
    else
      @user.password = params[:user][:password]
      @user.password_confirmation = params[:user][:password_confirmation]
      @user.password_recovery_code = ''
      @user.password_recovery_code_set = nil
      if @user.save
---
UPDATE `users` SET `updated_at` = '2009-11-28 19:05:48', `password_recovery_code` = NULL, `password` = '005d343c2e2bdf0eb71e2880fef54140' WHERE `id` = 11

  def update
		@user = User.find_by_id(params[:user][:id])
    old_username = @user.username
		unless @user == nil
			if params[:user][:password] == ''
				params[:user].delete(:password)
				params[:user].delete(:password_confirmation)
			end
			if params[:user][:email] == '' or params[:user][:email].downcase == @user.email
				params[:user].delete(:email)
				params[:user].delete(:email_confirmation)
			end
			@user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-12-09 12:22:55', `username` = 'ryan', `verification_code` = 'bf765bc283d5422a523f9892fc67d4ae', `verified` = 0, `email` = 'rlmartin@gmail.com' WHERE `id` = 13

  def verify
    @verified = false
		@user = User.find_by_username(params[:username])
    unless @user == nil
		  if @user.verified
        @verified = true
		  elsif @user.verification_code == params[:code]
			  @user.verified = true
			  @user.verification_code = ''
			  @user.save
---
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'ryan' AND `users`.id <> 4) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-11-26 14:20:33', `verification_code` = '', `verified` = 1, `password` = '04f02fdddd46774f430164079c18dad9' WHERE `id` = 4

	def load_user_from_param
		@page[:title] = t(:title_error_user_not_found)
    if params[:username] == nil and params[:user][:username] != nil: params[:username] = params[:user][:username] end
		@user = User.find_by_username(params[:username])
---
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'ryan' AND `users`.id <> 11) LIMIT 1